# Задача 32: Определить индексы элементов массива (списка), значения которых принадлежат заданному диапазону
# (т.е. не меньше заданного минимума и не больше заданного максимума)
# Ввод:  [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
# 5
# 15
# Вывод: [1, 9, 13, 14, 19

lis1 = [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
min_int = int(input('Введите минимальное значение: '))
max_int = int(input('Введите минимальное значение: '))
new_lst = []
for i in range(len(lis1)):
    if min_int <= lis1[i] <= max_int:
        new_lst.append(i)
print(new_lst)

